modules/home/emacs/init.org
# -*- mode: org; coding: utf-8; -*-
#+title: Literate Emacs configuration
#+author: John Lambert
#+startup: overview
#+property: header-args:emacs-lisp :tangle init.el :results none :comments no

* Overview
** Will the real init.org please stand up?
:PROPERTIES:
:ID:       01KT47Z8NX9E82FSJAMM1JC2AJ
:END:

After years of vim/neovim use I finally took the plunge and decided to switch to emacs. This was something I agonized over. (Seriously. I am a loser.) I have years and years of experience and muscle memory with vim. Even though I probably took advantage of very few of its advanced features I still made my brain fit its paradigm.

What changed? Org-mode.

Org-mode allows code to exist coherently alongside text, notes and task management. In the age of LLMs this is particularly important as it creates a kind of shared artifact for me and my silicon buddies.

The most intriguing file to org-ify is the emacs configuration itself.

That means the real =~/.emacs.d/init.el= is *generated* from this file during the
Home Manager build. That gives me three nice properties at once:

1. The configuration stays reproducible and Nix-friendly.
2. The reasoning for each section can live right next to the code.
3. The TODOs can live right alongside the code itself. That means that I can create something like:
*** TODO Write a sample todo :nix-config: :example-todo:

:PROPERTIES:
:ID:       01KT4816KR4EVKS5Y1CZANCFA7
:END:

and it will just transparently live with the code /in situ/ but also be managed by globally by org-agenda.
** Evil Mode   
Luckily for vim refugees like myself there are all sorts of interesting ways to accomodate the years we spent trying to figure out how to exit it. Emacs provides the very appropriately named 'evil-mode' for this purpose.

I am sure I have fallen into several anti patterns here. I will definitely always speak emacs with a Vimmy accent. But this isn't meant so much as an authoritative, *Do as I do... or else!* kind of thing, but rather as a monument to compromise with the One True and Right Way of Emacs. Mastery of idiom is an important part of learning a language and a culture. I am definitely not there yet, so bear with me. 
** Note system
I will be storing the majority of my notes in a directory I call ~/chronofile. This is an homage to the great [[https://en.wikipedia.org/wiki/Buckminster_Fuller][Buckminster Fuller]] and his 63 year project the [[https://en.wikipedia.org/wiki/Dymaxion_Chronofile][Dymaxion Chronofile.]]

I hope that this will one day grow into a:
- personal knowledge management system
- technical writing publishing platform for a blog engine
- agent prompting system
- task management tool
- autobiography
- fiction and metafiction tool
- homelab configuration 
:PROPERTIES:
:ID:       01KT488BAGJPRJQRHCQD6FY55H
:END:

Anyway, here's 'Wonderwall...'

* Package bootstrap

This first block does the minimum work needed to talk to Emacs package
archives and to ensure =use-package= is available.

One slightly frustrating thing is that emacs doesn't support this org and org-babel tangling business out of the box. So in order to make this somewhat intelligible to nix it has to lean on some preexisting customizations.

Other than that, it follows a pretty common approach:

- MELPA is used for fast-moving community packages.
- Org ELPA is added so Org can be updated independently when desired.
- GNU ELPA stays available for the usual core add-ons.
- =package-initialize= turns on installed packages.
- If archive metadata is missing, Emacs refreshes package contents.
- =use-package= becomes the common declaration form for the rest of the file.

Because this config is also deployed through Nix, this is a hybrid setup:
Nix provides some packages declaratively, while Emacs package.el still pulls
in others at runtime. That is a little "frankenstein", but it is a perfectly
workable intermediate state.

BTW kids I remember before we had all these fancy language specific repositories. I spent half of 2006 looking for a .dll. 

#+begin_src emacs-lisp
;; Initialize package sources.
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(setq-default word-wrap t)

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))

;; Install use-package for easier package management.
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* Theme

The theme choice is straightforward: load a Gruvbox variant and aggressively
clear any previously enabled themes first.

My read of this is:

- =custom-safe-themes t= is here to avoid repeated safe-theme prompts.
- Disabling all current themes before loading the new one prevents theme
  stacking and weird face inheritance.
- =gruvbox-dark-medium= is the preferred baseline.

#+begin_src emacs-lisp
(use-package gruvbox-theme
  :config
  (setq custom-safe-themes t)
  (mapc #'disable-theme custom-enabled-themes)
  (load-theme 'gruvbox-dark-medium t))
#+end_src
