modules/home/emacs/exports/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-05 Fri 16:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literate Emacs configuration</title>
<meta name="author" content="John Lambert" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Literate Emacs configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge47eab4">1. Overview</a>
<ul>
<li><a href="#org20af236">1.1. Will the real init.org please stand up?</a>
<ul>
<li><a href="#orge7b5d5b">1.1.1. <span class="todo TODO">TODO</span> Write a sample todo :nix-config: :example-todo:</a></li>
</ul>
</li>
<li><a href="#org8e484cb">1.2. Evil Mode</a></li>
<li><a href="#orga834c32">1.3. Note system</a></li>
</ul>
</li>
<li><a href="#orge3958e0">2. Package bootstrap</a></li>
<li><a href="#org9303beb">3. Theme</a></li>
<li><a href="#org07e9fb7">4. Org mode foundation</a></li>
<li><a href="#org9087f6e">5. Indentation policy</a></li>
<li><a href="#org68ef6d7">6. ULID support for Org headings</a></li>
<li><a href="#org58f5da8">7. Org export and Babel execution</a></li>
<li><a href="#org542264c">8. AI helpers</a></li>
<li><a href="#org4c51a81">9. Window movement and in-buffer discoverability</a></li>
<li><a href="#orgbd97ef1">10. General packages</a></li>
<li><a href="#org42c9905">11. Local terminal helper</a></li>
<li><a href="#org4c63dc7">12. Journal and note capture</a></li>
<li><a href="#org5587451">13. Basic UI defaults</a></li>
<li><a href="#org16aee04">14. Undo / redo sanity</a></li>
<li><a href="#org8ce93b4">15. Chronofile-centric Org workflow</a></li>
<li><a href="#org9ef1382">16. Evil mode</a></li>
<li><a href="#orge9e8084">17. Final global bindings</a></li>
<li><a href="#org86a7ce1">18. Notes for future cleanup</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge47eab4" class="outline-2">
<h2 id="orge47eab4"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org20af236" class="outline-3">
<h3 id="org20af236"><span class="section-number-3">1.1.</span> Will the real init.org please stand up?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
After years of vim/neovim use I finally took the plunge and decided to switch to emacs. This was something I agonized over. (Seriously. I am a loser.) I have years and years of experience and muscle memory with vim. Even though I probably took advantage of very few of its advanced features I still made my brain fit its paradigm.
</p>

<p>
What changed? Org-mode.
</p>

<p>
Org-mode allows code to exist coherently alongside text, notes and task management. In the age of LLMs this is particularly important as it creates a kind of shared artifact for me and my silicon buddies.
</p>

<p>
The most intriguing file to org-ify is the emacs configuration itself.
</p>

<p>
That means the real <code>~/.emacs.d/init.el</code> is <b>generated</b> from this file during the
Home Manager build. That gives me three nice properties at once:
</p>

<ol class="org-ol">
<li>The configuration stays reproducible and Nix-friendly.</li>
<li>The reasoning for each section can live right next to the code.</li>
<li>The TODOs can live right alongside the code itself. That means that I can create something like:</li>
</ol>
</div>
<div id="outline-container-orge7b5d5b" class="outline-4">
<h4 id="orge7b5d5b"><span class="section-number-4">1.1.1.</span> <span class="todo TODO">TODO</span> Write a sample todo :nix-config: :example-todo:</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
and it will just transparently live with the code <i>in situ</i> but also be managed by globally by org-agenda.
</p>
</div>
</div>
</div>
<div id="outline-container-org8e484cb" class="outline-3">
<h3 id="org8e484cb"><span class="section-number-3">1.2.</span> Evil Mode</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Luckily for vim refugees like myself there are all sorts of interesting ways to accomodate the years we spent trying to figure out how to exit it. Emacs provides the very appropriately named 'evil-mode' for this purpose.
</p>

<p>
I am sure I have fallen into several anti patterns here. I will definitely always speak emacs with a Vimmy accent. But this isn't meant so much as an authoritative, <b>Do as I do&#x2026; or else!</b> kind of thing, but rather as a monument to compromise with the One True and Right Way of Emacs. Mastery of idiom is an important part of learning a language and a culture. I am definitely not there yet, so bear with me. 
</p>
</div>
</div>
<div id="outline-container-orga834c32" class="outline-3">
<h3 id="orga834c32"><span class="section-number-3">1.3.</span> Note system</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I will be storing the majority of my notes in a directory I call ~/chronofile. This is an homage to the great <a href="https://en.wikipedia.org/wiki/Buckminster_Fuller">Buckminster Fuller</a> and his 63 year project the <a href="https://en.wikipedia.org/wiki/Dymaxion_Chronofile">Dymaxion Chronofile.</a>
</p>

<p>
I hope that this will one day grow into a:
</p>
<ul class="org-ul">
<li>personal knowledge management system</li>
<li>technical writing publishing platform for a blog engine</li>
<li>agent prompting system</li>
<li>task management tool</li>
<li>autobiography</li>
<li>fiction and metafiction tool</li>
<li>homelab configuration</li>
</ul>
<p>
:ID:       01KT488BAGJPRJQRHCQD6FY55H
</p>

<p>
Anyway, here's 'Wonderwall&#x2026;'
</p>
</div>
</div>
</div>
<div id="outline-container-orge3958e0" class="outline-2">
<h2 id="orge3958e0"><span class="section-number-2">2.</span> Package bootstrap</h2>
<div class="outline-text-2" id="text-2">
<p>
This first block does the minimum work needed to talk to Emacs package
archives and to ensure <code>use-package</code> is available.
</p>

<p>
One slightly frustrating thing is that emacs doesn't support this org and org-babel tangling business out of the box. So in order to make this somewhat intelligible to nix it has to lean on some preexisting customizations.
</p>

<p>
Other than that, it follows a pretty common approach:
</p>

<ul class="org-ul">
<li>MELPA is used for fast-moving community packages.</li>
<li>Org ELPA is added so Org can be updated independently when desired.</li>
<li>GNU ELPA stays available for the usual core add-ons.</li>
<li><code>package-initialize</code> turns on installed packages.</li>
<li>If archive metadata is missing, Emacs refreshes package contents.</li>
<li><code>use-package</code> becomes the common declaration form for the rest of the file.</li>
</ul>

<p>
Because this config is also deployed through Nix, this is a hybrid setup:
Nix provides some packages declaratively, while Emacs package.el still pulls
in others at runtime. That is a little "frankenstein", but it is a perfectly
workable intermediate state.
</p>

<p>
BTW kids I remember before we had all these fancy language specific repositories. I spent half of 2006 looking for a .dll. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Initialize package sources.
</span>(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)

(<span class="org-keyword">setq</span> package-archives '((<span class="org-string">"melpa"</span> . <span class="org-string">"https://melpa.org/packages/"</span>)
                         (<span class="org-string">"org"</span> . <span class="org-string">"https://orgmode.org/elpa/"</span>)
                         (<span class="org-string">"elpa"</span> . <span class="org-string">"https://elpa.gnu.org/packages/"</span>)))

(<span class="org-keyword">setq-default</span> word-wrap t)

(package-initialize)

(<span class="org-keyword">unless</span> package-archive-contents
  (package-refresh-contents))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Install use-package for easier package management.
</span>(<span class="org-keyword">unless</span> (package-installed-p 'use-package)
  (package-install 'use-package))

(<span class="org-keyword">require</span> '<span class="org-constant">use-package</span>)
(<span class="org-keyword">setq</span> use-package-always-ensure t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9303beb" class="outline-2">
<h2 id="org9303beb"><span class="section-number-2">3.</span> Theme</h2>
<div class="outline-text-2" id="text-3">
<p>
The theme choice is straightforward: load a Gruvbox variant and aggressively
clear any previously enabled themes first.
</p>

<p>
My read of this is:
</p>

<ul class="org-ul">
<li><code>custom-safe-themes t</code> is here to avoid repeated safe-theme prompts.</li>
<li>Disabling all current themes before loading the new one prevents theme
stacking and weird face inheritance.</li>
<li><code>gruvbox-dark-medium</code> is the preferred baseline.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> gruvbox-theme
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> custom-safe-themes t)
  (mapc #'disable-theme custom-enabled-themes)
  (load-theme 'gruvbox-dark-medium t))
</pre>
</div>
</div>
</div>
