modules/home/emacs/init.org
* Org mode foundation

This is the heart of the setup.

The overall intent seems to be:

- make Org comfortable for everyday writing,
- make source blocks pleasant to edit,
- make HTML export look presentable out of the box, and
- make links easier to follow, especially with Evil in the mix.

A few noteworthy choices:

- =org-startup-indented= and hidden leading stars make files look cleaner.
- =org-ellipsis= uses a custom fold marker.
- =org-return-follows-link= makes =RET= more link-friendly.
- a small GTD-ish TODO workflow gives tasks a little more structure than a
  single =TODO/DONE= pair.
- logging completion / cancellation into drawers keeps historical metadata
  without cluttering the visible outline too badly.
- source block settings make Babel editing behave more like a real code editor.
- the HTML export header injects Bulma and some small custom CSS.

#+begin_src emacs-lisp
(defun my-org-mode-banner ()
  "Display a banner message in the minibuffer for org-mode."
  (message "Reminder: Toggle tasks with C-c C-t"))

(use-package org
  :ensure t
  :config
  (require 'ox-html)
  (setq org-startup-indented t)
  (setq org-hide-leading-stars t)
  (setq org-ellipsis " ▾")
  (setq org-return-follows-link t)
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "PROJECT(p)" "WAITING(w@/!)" "SOMEDAY(s)" "|" "DONE(d!)" "CANCELLED(c@)")))
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-src-fontify-natively t)
  (setq org-src-tab-acts-natively t)
  (setq org-edit-src-content-indentation 0)
  (setq org-cycle-hide-drawer-startup t)
  (setq org-src-lang-modes
        (append '(("nix" . nix)
                  ("coffee" . coffee)
                  ("js" . javascript)
                  ("javascript" . javascript)
                  ("sh" . shell)
                  ("bash" . shell)
                  ("elisp" . emacs-lisp))
                org-src-lang-modes))
  (setq org-export-with-toc t)
  (setq org-export-with-section-numbers t)
  (setq org-html-htmlize-output-type 'css)
  (setq org-html-validation-link nil)
  (setq org-html-head-include-default-style nil)
  (setq org-html-head-include-scripts nil)
  (setq org-html-head
        (concat
         "<link rel=\"stylesheet\" href=\"https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css\">\n"
         "<style>\n"
         "body { background: #fff; }\n"
         "#content.content { max-width: 72ch; margin: 3rem auto; padding: 0 1.5rem; }\n"
         "#table-of-contents { margin-bottom: 2rem; }\n"
         ".title { margin-bottom: 0.75rem; }\n"
         ".subtitle { color: #666; }\n"
         "pre.src { overflow-x: auto; padding: 1rem; }\n"
         "code { white-space: pre-wrap; }\n"
         "</style>")))

(use-package htmlize
  :ensure t)

(use-package ob-nix
  :ensure t)

(use-package coffee-mode
  :ensure t)

(use-package ob-coffee
  :ensure t
  :config
  (setq org-babel-coffee-command "coffee"))

(use-package ob-mermaid
  :ensure t
  :config
  (setq ob-mermaid-cli-path "mmdc"))
#+end_src

* Indentation policy

This section standardizes indentation across a handful of languages.

The intent seems practical rather than ideological:

- use 4 spaces for most programming languages,
- use 2 spaces for CoffeeScript,
- keep Evil shift width aligned with mode indentation so << and >> do what
  you expect.

#+begin_src emacs-lisp
(defun my/set-indent-4 ()
  "Use 4 spaces for indentation in the current buffer."
  (setq-local indent-tabs-mode nil)
  (setq-local tab-width 4)
  (setq-local standard-indent 4)
  (setq-local evil-shift-width 4))

(defun my/set-coffee-indent-2 ()
  "Use 2 spaces for indentation in CoffeeScript buffers."
  (setq-local indent-tabs-mode nil)
  (setq-local tab-width 2)
  (setq-local standard-indent 2)
  (setq-local coffee-tab-width 2)
  (setq-local evil-shift-width 2))

(add-hook 'emacs-lisp-mode-hook #'my/set-indent-4)
(add-hook 'js-mode-hook #'my/set-indent-4)
(add-hook 'js-ts-mode-hook #'my/set-indent-4)
(add-hook 'python-mode-hook
          (lambda ()
            (my/set-indent-4)
            (setq-local python-indent-offset 4)))
(add-hook 'sh-mode-hook
          (lambda ()
            (my/set-indent-4)
            (setq-local sh-basic-offset 4
                        sh-indentation 4)))
(add-hook 'nix-mode-hook #'my/set-indent-4)
(add-hook 'coffee-mode-hook #'my/set-coffee-indent-2)
#+end_src

