modules/home/emacs/exports/init.html
<div id="outline-container-org07e9fb7" class="outline-2">
<h2 id="org07e9fb7"><span class="section-number-2">4.</span> Org mode foundation</h2>
<div class="outline-text-2" id="text-4">
<p>
This is the heart of the setup.
</p>

<p>
The overall intent seems to be:
</p>

<ul class="org-ul">
<li>make Org comfortable for everyday writing,</li>
<li>make source blocks pleasant to edit,</li>
<li>make HTML export look presentable out of the box, and</li>
<li>make links easier to follow, especially with Evil in the mix.</li>
</ul>

<p>
A few noteworthy choices:
</p>

<ul class="org-ul">
<li><code>org-startup-indented</code> and hidden leading stars make files look cleaner.</li>
<li><code>org-ellipsis</code> uses a custom fold marker.</li>
<li><code>org-return-follows-link</code> makes <code>RET</code> more link-friendly.</li>
<li>a small GTD-ish TODO workflow gives tasks a little more structure than a
single <code>TODO/DONE</code> pair.</li>
<li>logging completion / cancellation into drawers keeps historical metadata
without cluttering the visible outline too badly.</li>
<li>source block settings make Babel editing behave more like a real code editor.</li>
<li>the HTML export header injects Bulma and some small custom CSS.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my-org-mode-banner</span> ()
  <span class="org-doc">"Display a banner message in the minibuffer for org-mode."</span>
  (message <span class="org-string">"Reminder: Toggle tasks with C-c C-t"</span>))

(<span class="org-keyword">use-package</span> org
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">require</span> '<span class="org-constant">ox-html</span>)
  (<span class="org-keyword">setq</span> org-startup-indented t)
  (<span class="org-keyword">setq</span> org-hide-leading-stars t)
  (<span class="org-keyword">setq</span> org-ellipsis <span class="org-string">" &#9662;"</span>)
  (<span class="org-keyword">setq</span> org-return-follows-link t)
  (<span class="org-keyword">setq</span> org-todo-keywords
        '((sequence <span class="org-string">"TODO(t)"</span> <span class="org-string">"NEXT(n)"</span> <span class="org-string">"PROJECT(p)"</span> <span class="org-string">"WAITING(w@/!)"</span> <span class="org-string">"SOMEDAY(s)"</span> <span class="org-string">"|"</span> <span class="org-string">"DONE(d!)"</span> <span class="org-string">"CANCELLED(c@)"</span>)))
  (<span class="org-keyword">setq</span> org-log-done 'time)
  (<span class="org-keyword">setq</span> org-log-into-drawer t)
  (<span class="org-keyword">setq</span> org-src-fontify-natively t)
  (<span class="org-keyword">setq</span> org-src-tab-acts-natively t)
  (<span class="org-keyword">setq</span> org-edit-src-content-indentation 0)
  (<span class="org-keyword">setq</span> org-cycle-hide-drawer-startup t)
  (<span class="org-keyword">setq</span> org-src-lang-modes
        (append '((<span class="org-string">"nix"</span> . nix)
                  (<span class="org-string">"coffee"</span> . coffee)
                  (<span class="org-string">"js"</span> . javascript)
                  (<span class="org-string">"javascript"</span> . javascript)
                  (<span class="org-string">"sh"</span> . shell)
                  (<span class="org-string">"bash"</span> . shell)
                  (<span class="org-string">"elisp"</span> . emacs-lisp))
                org-src-lang-modes))
  (<span class="org-keyword">setq</span> org-export-with-toc t)
  (<span class="org-keyword">setq</span> org-export-with-section-numbers t)
  (<span class="org-keyword">setq</span> org-html-htmlize-output-type 'css)
  (<span class="org-keyword">setq</span> org-html-validation-link nil)
  (<span class="org-keyword">setq</span> org-html-head-include-default-style nil)
  (<span class="org-keyword">setq</span> org-html-head-include-scripts nil)
  (<span class="org-keyword">setq</span> org-html-head
        (concat
         <span class="org-string">"&lt;link rel=\"stylesheet\" href=\"https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css\"&gt;\n"</span>
         <span class="org-string">"&lt;style&gt;\n"</span>
         <span class="org-string">"body { background: #fff; }\n"</span>
         <span class="org-string">"#content.content { max-width: 72ch; margin: 3rem auto; padding: 0 1.5rem; }\n"</span>
         <span class="org-string">"#table-of-contents { margin-bottom: 2rem; }\n"</span>
         <span class="org-string">".title { margin-bottom: 0.75rem; }\n"</span>
         <span class="org-string">".subtitle { color: #666; }\n"</span>
         <span class="org-string">"pre.src { overflow-x: auto; padding: 1rem; }\n"</span>
         <span class="org-string">"code { white-space: pre-wrap; }\n"</span>
         <span class="org-string">"&lt;/style&gt;"</span>)))

(<span class="org-keyword">use-package</span> htmlize
  <span class="org-builtin">:ensure</span> t)

(<span class="org-keyword">use-package</span> ob-nix
  <span class="org-builtin">:ensure</span> t)

(<span class="org-keyword">use-package</span> coffee-mode
  <span class="org-builtin">:ensure</span> t)

(<span class="org-keyword">use-package</span> ob-coffee
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> org-babel-coffee-command <span class="org-string">"coffee"</span>))

(<span class="org-keyword">use-package</span> ob-mermaid
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> ob-mermaid-cli-path <span class="org-string">"mmdc"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org9087f6e" class="outline-2">
<h2 id="org9087f6e"><span class="section-number-2">5.</span> Indentation policy</h2>
<div class="outline-text-2" id="text-5">
<p>
This section standardizes indentation across a handful of languages.
</p>

<p>
The intent seems practical rather than ideological:
</p>

<ul class="org-ul">
<li>use 4 spaces for most programming languages,</li>
<li>use 2 spaces for CoffeeScript,</li>
<li>keep Evil shift width aligned with mode indentation so &lt;&lt; and &gt;&gt; do what
you expect.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/set-indent-4</span> ()
  <span class="org-doc">"Use 4 spaces for indentation in the current buffer."</span>
  (<span class="org-keyword">setq-local</span> indent-tabs-mode nil)
  (<span class="org-keyword">setq-local</span> tab-width 4)
  (<span class="org-keyword">setq-local</span> standard-indent 4)
  (<span class="org-keyword">setq-local</span> evil-shift-width 4))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/set-coffee-indent-2</span> ()
  <span class="org-doc">"Use 2 spaces for indentation in CoffeeScript buffers."</span>
  (<span class="org-keyword">setq-local</span> indent-tabs-mode nil)
  (<span class="org-keyword">setq-local</span> tab-width 2)
  (<span class="org-keyword">setq-local</span> standard-indent 2)
  (<span class="org-keyword">setq-local</span> coffee-tab-width 2)
  (<span class="org-keyword">setq-local</span> evil-shift-width 2))

(add-hook 'emacs-lisp-mode-hook #'my/set-indent-4)
(add-hook 'js-mode-hook #'my/set-indent-4)
(add-hook 'js-ts-mode-hook #'my/set-indent-4)
(add-hook 'python-mode-hook
          (<span class="org-keyword">lambda</span> ()
            (my/set-indent-4)
            (<span class="org-keyword">setq-local</span> python-indent-offset 4)))
(add-hook 'sh-mode-hook
          (<span class="org-keyword">lambda</span> ()
            (my/set-indent-4)
            (<span class="org-keyword">setq-local</span> sh-basic-offset 4
                        sh-indentation 4)))
(add-hook 'nix-mode-hook #'my/set-indent-4)
(add-hook 'coffee-mode-hook #'my/set-coffee-indent-2)
</pre>
</div>
</div>
</div>
