modules/home/emacs/init.org
* ULID support for Org headings

This is one of the more distinctive custom pieces.

The idea is to assign stable IDs to Org headings, but to do it with ULIDs
instead of the more common random UUIDs or Org's own =org-id= helpers.

Why might this exist?

- ULIDs are sortable by time.
- They are shorter and friendlier than many UUID renderings.
- Stable heading IDs make linking and refiling safer over time.

The code below:

- defines a Crockford Base32 alphabet,
- generates a time-sortable ULID-ish identifier,
- adds an =ID= property to new headings,
- stamps headings when pressing =org-return=, and
- provides a whole-buffer repair command for backfilling missing IDs.

The note in the docstring is important: this is *not strictly monotonic*
within the same millisecond, but for personal notes that is usually fine.

#+begin_src emacs-lisp
(defconst my/ulid-alphabet "0123456789ABCDEFGHJKMNPQRSTVWXYZ"
  "Crockford Base32 alphabet used by ULIDs.")

(random t)

(defun my/ulid--encode-base32 (num len)
  "Encode NUM in Crockford Base32, left-padded to LEN characters."
  (let ((out (make-string len ?0)))
    (dotimes (i len out)
      (aset out (- len 1 i)
            (aref my/ulid-alphabet (% num 32)))
      (setq num (/ num 32)))))

(defun my/generate-ulid ()
  "Generate a ULID string.

This implementation is time-sortable, but not strictly monotonic when
multiple IDs are created within the same millisecond."
  (let* ((time-ms (floor (* 1000 (float-time))))
         (r1 (random (expt 2 20)))
         (r2 (random (expt 2 20)))
         (r3 (random (expt 2 20)))
         (r4 (random (expt 2 20)))
         (rand80 (+ (lsh r1 60)
                    (lsh r2 40)
                    (lsh r3 20)
                    r4)))
    (concat (my/ulid--encode-base32 time-ms 10)
            (my/ulid--encode-base32 rand80 16))))

(defun my/org-add-id-to-new-heading ()
  "Add a ULID-backed ID property to the current Org heading if missing."
  (when (derived-mode-p 'org-mode)
    (save-excursion
      (org-back-to-heading t)
      (unless (org-entry-get (point) "ID")
        (org-entry-put (point) "ID" (my/generate-ulid))))))

(defun my/org-add-id-at-point-if-heading ()
  "Add a ULID-backed ID to the heading at point, if there is one."
  (when (and (derived-mode-p 'org-mode)
             (org-at-heading-p))
    (my/org-add-id-to-new-heading)))

(defun my/org-return-stamp-id-before (&rest _)
  "Stamp the current Org heading with a ULID-backed ID before `org-return'."
  (my/org-add-id-at-point-if-heading))

(defun my/org-ulidize-buffer ()
  "Add ULID-backed ID properties to headings in the current Org buffer.

Existing IDs are preserved."
  (interactive)
  (unless (derived-mode-p 'org-mode)
    (user-error "Current buffer is not in Org mode"))
  (let ((count 0))
    (org-map-entries
     (lambda ()
       (unless (org-entry-get (point) "ID")
         (org-entry-put (point) "ID" (my/generate-ulid))
         (setq count (1+ count))))
     nil
     'file)
    (message "Added ULID IDs to %d heading%s"
             count
             (if (= count 1) "" "s"))))
#+end_src

