modules/home/emacs/exports/init.html
<div id="outline-container-org68ef6d7" class="outline-2">
<h2 id="org68ef6d7"><span class="section-number-2">6.</span> ULID support for Org headings</h2>
<div class="outline-text-2" id="text-6">
<p>
This is one of the more distinctive custom pieces.
</p>

<p>
The idea is to assign stable IDs to Org headings, but to do it with ULIDs
instead of the more common random UUIDs or Org's own <code>org-id</code> helpers.
</p>

<p>
Why might this exist?
</p>

<ul class="org-ul">
<li>ULIDs are sortable by time.</li>
<li>They are shorter and friendlier than many UUID renderings.</li>
<li>Stable heading IDs make linking and refiling safer over time.</li>
</ul>

<p>
The code below:
</p>

<ul class="org-ul">
<li>defines a Crockford Base32 alphabet,</li>
<li>generates a time-sortable ULID-ish identifier,</li>
<li>adds an <code>ID</code> property to new headings,</li>
<li>stamps headings when pressing <code>org-return</code>, and</li>
<li>provides a whole-buffer repair command for backfilling missing IDs.</li>
</ul>

<p>
The note in the docstring is important: this is <b>not strictly monotonic</b>
within the same millisecond, but for personal notes that is usually fine.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defconst</span> <span class="org-variable-name">my/ulid-alphabet</span> <span class="org-string">"0123456789ABCDEFGHJKMNPQRSTVWXYZ"</span>
  <span class="org-doc">"Crockford Base32 alphabet used by ULIDs."</span>)

(random t)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/ulid--encode-base32</span> (num len)
  <span class="org-doc">"Encode NUM in Crockford Base32, left-padded to LEN characters."</span>
  (<span class="org-keyword">let</span> ((out (make-string len ?0)))
    (<span class="org-keyword">dotimes</span> (i len out)
      (aset out (- len 1 i)
            (aref my/ulid-alphabet (% num 32)))
      (<span class="org-keyword">setq</span> num (/ num 32)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/generate-ulid</span> ()
  <span class="org-doc">"Generate a ULID string.

This implementation is time-sortable, but not strictly monotonic when
multiple IDs are created within the same millisecond."</span>
  (<span class="org-keyword">let*</span> ((time-ms (floor (* 1000 (float-time))))
         (r1 (random (expt 2 20)))
         (r2 (random (expt 2 20)))
         (r3 (random (expt 2 20)))
         (r4 (random (expt 2 20)))
         (rand80 (+ (lsh r1 60)
                    (lsh r2 40)
                    (lsh r3 20)
                    r4)))
    (concat (my/ulid--encode-base32 time-ms 10)
            (my/ulid--encode-base32 rand80 16))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-add-id-to-new-heading</span> ()
  <span class="org-doc">"Add a ULID-backed ID property to the current Org heading if missing."</span>
  (<span class="org-keyword">when</span> (derived-mode-p 'org-mode)
    (<span class="org-keyword">save-excursion</span>
      (org-back-to-heading t)
      (<span class="org-keyword">unless</span> (org-entry-get (point) <span class="org-string">"ID"</span>)
        (org-entry-put (point) <span class="org-string">"ID"</span> (my/generate-ulid))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-add-id-at-point-if-heading</span> ()
  <span class="org-doc">"Add a ULID-backed ID to the heading at point, if there is one."</span>
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (derived-mode-p 'org-mode)
             (org-at-heading-p))
    (my/org-add-id-to-new-heading)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-return-stamp-id-before</span> (<span class="org-type">&amp;rest</span> _)
  <span class="org-doc">"Stamp the current Org heading with a ULID-backed ID before `</span><span class="org-doc"><span class="org-constant">org-return</span></span><span class="org-doc">'."</span>
  (my/org-add-id-at-point-if-heading))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-ulidize-buffer</span> ()
  <span class="org-doc">"Add ULID-backed ID properties to headings in the current Org buffer.

Existing IDs are preserved."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">unless</span> (derived-mode-p 'org-mode)
    (<span class="org-warning">user-error</span> <span class="org-string">"Current buffer is not in Org mode"</span>))
  (<span class="org-keyword">let</span> ((count 0))
    (org-map-entries
     (<span class="org-keyword">lambda</span> ()
       (<span class="org-keyword">unless</span> (org-entry-get (point) <span class="org-string">"ID"</span>)
         (org-entry-put (point) <span class="org-string">"ID"</span> (my/generate-ulid))
         (<span class="org-keyword">setq</span> count (1+ count))))
     nil
     'file)
    (message <span class="org-string">"Added ULID IDs to %d heading%s"</span>
             count
             (<span class="org-keyword">if</span> (= count 1) <span class="org-string">""</span> <span class="org-string">"s"</span>))))
</pre>
</div>
</div>
</div>
