modules/home/emacs/init.org
* Org export and Babel execution

This configuration treats Org as both a writing format and an executable
notebook format.

The export helper writes HTML output into a local =exports/= directory next to
its source file and opens the result in a browser. That is a pleasant workflow
for publishing one-off notes or drafts without having to configure a full site.

The Babel section enables a modest set of languages:

- Emacs Lisp
- shell
- Python
- Nix
- JavaScript
- CoffeeScript (really)
- Mermaid for charting

Given the repository, the Nix support is especially relevant.

#+begin_src emacs-lisp
(defun my/org-export-asset-files ()
  "Collect local file assets referenced by the current Org buffer."
  (let ((base-dir (file-name-directory (or (buffer-file-name) default-directory)))
        assets)
    (org-element-map (org-element-parse-buffer) 'link
      (lambda (link)
        (when (string= (org-element-property :type link) "file")
          (let* ((path (org-link-unescape (org-element-property :path link)))
                 (file (expand-file-name path base-dir)))
            (when (file-regular-p file)
              (push file assets))))))
    (org-element-map (org-element-parse-buffer) 'src-block
      (lambda (src)
        (let* ((params (org-babel-parse-header-arguments (or (org-element-property :parameters src) "")))
               (path (cdr (assq :file params)))
               (file (and path (expand-file-name path base-dir))))
          (when (and file (file-regular-p file))
            (push file assets)))))
    (delete-dups assets)))

(defun my/org-copy-export-assets (export-dir)
  "Copy local Org asset files into EXPORT-DIR, preserving relative paths when possible."
  (let ((base-dir (file-name-directory (or (buffer-file-name) default-directory))))
    (dolist (file (my/org-export-asset-files))
      (let* ((relative (file-relative-name file base-dir))
             (target (expand-file-name
                      (if (string-prefix-p "../" relative)
                          (file-name-nondirectory file)
                        relative)
                      export-dir)))
        (make-directory (file-name-directory target) t)
        (copy-file file target t)))))

(defun my/org-render-mermaid-blocks ()
  "Render all Mermaid source blocks in the current Org buffer."
  (require 'ob-mermaid)
  (org-babel-map-src-blocks nil
    (let* ((info (org-babel-get-src-block-info 'light))
           (lang (car info))
           (params (nth 2 info))
           (file (cdr (assq :file params))))
      (when (string= lang "mermaid")
        (when file
          (make-directory (file-name-directory (expand-file-name file default-directory)) t))
        (org-babel-execute-src-block)))))

(defun my/org-export-to-html ()
  "Export the current Org buffer to HTML in an exports directory and open it."
  (interactive)
  (unless (derived-mode-p 'org-mode)
    (user-error "Current buffer is not in Org mode"))
  (let* ((source-file (or (buffer-file-name)
                          (expand-file-name "untitled.org" default-directory)))
         (export-dir (expand-file-name "exports" (file-name-directory source-file)))
         (output-file (expand-file-name
                       (concat (file-name-base source-file) ".html")
                       export-dir))
         (org-export-show-temporary-export-buffer nil)
         (org-confirm-babel-evaluate nil))
    (make-directory export-dir t)
    (my/org-render-mermaid-blocks)
    (my/org-copy-export-assets export-dir)
    (org-export-to-file 'html output-file)
    (browse-url-of-file output-file)
    (message "Exported HTML to %s" output-file)))

(with-eval-after-load 'org
  (require 'ob-mermaid)
  (setq org-babel-python-command "python3")
  (setq org-babel-js-cmd "node")
  (add-hook 'org-insert-heading-hook #'my/org-add-id-to-new-heading)
  (advice-add 'org-return :before #'my/org-return-stamp-id-before)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (python . t)
     (nix . t)
     (js . t)
     (coffee . t)
     (mermaid . t))))

(add-hook 'org-mode-hook 'my-org-mode-banner)
#+end_src

* AI helpers

This section pulls in a small collection of AI-adjacent packages.

The shape of the config suggests a few things:

- =gptel= is the lightest-weight chat integration.
- =aidermacs= is for repo-aware editing assistance.
- =pi-coding-agent= is installed via Nix and treated as a first-class tool.
- model names and API keys are driven by environment variables where needed.

I am preserving the exact behavior here rather than trying to rationalize it.
In particular, several of these packages overlap conceptually, but that may be
intentional experimentation.

#+begin_src emacs-lisp
(use-package gptel
  :ensure t
  :config
  (setq gptel-api-key (getenv "OPENAI_API_KEY"))
  (setq gptel-default-model "gpt-4o"))

(use-package elysium)

(with-eval-after-load 'evil
  (define-key evil-normal-state-map (kbd "C-c g") 'gptel))

(use-package aidermacs
  :config
  (setq aidermacs-api-key (getenv "OPENAI_API_KEY"))
  (setq aidermacs-default-model "gpt-4o")
  :bind (("C-c a" . aidermacs-transient-menu)))

(global-set-key (kbd "C-c g c") 'gptel-start-chat)
#+end_src

* Window movement and in-buffer discoverability

These bindings repurpose =C-h/j/k/l= for pane movement.

That is a very Vim/Evil-shaped choice, and it explains why default Emacs help
commands feel displaced elsewhere. Because =C-h= normally starts Help, the
config also puts Help on =C-c h=.

This is likely the source of some of the earlier confusion around =describe-key=
not being reachable via the stock Emacs help prefix.

#+begin_src emacs-lisp
(windmove-default-keybindings)

(global-set-key (kbd "C-h") 'windmove-left)
(global-set-key (kbd "C-j") 'windmove-down)
(global-set-key (kbd "C-k") 'windmove-up)
(global-set-key (kbd "C-l") 'windmove-right)
(global-set-key (kbd "C-c h") 'help-command)
#+end_src

