modules/home/emacs/exports/init.html
<div id="outline-container-org58f5da8" class="outline-2">
<h2 id="org58f5da8"><span class="section-number-2">7.</span> Org export and Babel execution</h2>
<div class="outline-text-2" id="text-7">
<p>
This configuration treats Org as both a writing format and an executable
notebook format.
</p>

<p>
The export helper writes HTML output into a local <code>exports/</code> directory next to
its source file and opens the result in a browser. That is a pleasant workflow
for publishing one-off notes or drafts without having to configure a full site.
</p>

<p>
The Babel section enables a modest set of languages:
</p>

<ul class="org-ul">
<li>Emacs Lisp</li>
<li>shell</li>
<li>Python</li>
<li>Nix</li>
<li>JavaScript</li>
<li>CoffeeScript</li>
</ul>

<p>
Given the repository, the Nix support is especially relevant.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-export-asset-files</span> ()
  <span class="org-doc">"Collect local file assets referenced by the current Org buffer."</span>
  (<span class="org-keyword">let</span> ((base-dir (file-name-directory (<span class="org-keyword">or</span> (buffer-file-name) default-directory)))
        assets)
    (org-element-map (org-element-parse-buffer) 'link
      (<span class="org-keyword">lambda</span> (link)
        (<span class="org-keyword">when</span> (string= (org-element-property <span class="org-builtin">:type</span> link) <span class="org-string">"file"</span>)
          (<span class="org-keyword">let*</span> ((path (org-link-unescape (org-element-property <span class="org-builtin">:path</span> link)))
                 (file (expand-file-name path base-dir)))
            (<span class="org-keyword">when</span> (file-regular-p file)
              (<span class="org-keyword">push</span> file assets))))))
    (org-element-map (org-element-parse-buffer) 'src-block
      (<span class="org-keyword">lambda</span> (src)
        (<span class="org-keyword">let*</span> ((params (org-babel-parse-header-arguments (<span class="org-keyword">or</span> (org-element-property <span class="org-builtin">:parameters</span> src) <span class="org-string">""</span>)))
               (path (cdr (assq <span class="org-builtin">:file</span> params)))
               (file (<span class="org-keyword">and</span> path (expand-file-name path base-dir))))
          (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> file (file-regular-p file))
            (<span class="org-keyword">push</span> file assets)))))
    (delete-dups assets)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-copy-export-assets</span> (export-dir)
  <span class="org-doc">"Copy local Org asset files into EXPORT-DIR, preserving relative paths when possible."</span>
  (<span class="org-keyword">let</span> ((base-dir (file-name-directory (<span class="org-keyword">or</span> (buffer-file-name) default-directory))))
    (<span class="org-keyword">dolist</span> (file (my/org-export-asset-files))
      (<span class="org-keyword">let*</span> ((relative (file-relative-name file base-dir))
             (target (expand-file-name
                      (<span class="org-keyword">if</span> (string-prefix-p <span class="org-string">"../"</span> relative)
                          (file-name-nondirectory file)
                        relative)
                      export-dir)))
        (make-directory (file-name-directory target) t)
        (copy-file file target t)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-render-mermaid-blocks</span> ()
  <span class="org-doc">"Render all Mermaid source blocks in the current Org buffer."</span>
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-mermaid</span>)
  (<span class="org-keyword">org-babel-map-src-blocks</span> nil
    (<span class="org-keyword">let*</span> ((info (org-babel-get-src-block-info 'light))
           (lang (car info))
           (params (nth 2 info))
           (file (cdr (assq <span class="org-builtin">:file</span> params))))
      (<span class="org-keyword">when</span> (string= lang <span class="org-string">"mermaid"</span>)
        (<span class="org-keyword">when</span> file
          (make-directory (file-name-directory (expand-file-name file default-directory)) t))
        (org-babel-execute-src-block)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-export-to-html</span> ()
  <span class="org-doc">"Export the current Org buffer to HTML in an exports directory and open it."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">unless</span> (derived-mode-p 'org-mode)
    (<span class="org-warning">user-error</span> <span class="org-string">"Current buffer is not in Org mode"</span>))
  (<span class="org-keyword">let*</span> ((source-file (<span class="org-keyword">or</span> (buffer-file-name)
                          (expand-file-name <span class="org-string">"untitled.org"</span> default-directory)))
         (export-dir (expand-file-name <span class="org-string">"exports"</span> (file-name-directory source-file)))
         (output-file (expand-file-name
                       (concat (file-name-base source-file) <span class="org-string">".html"</span>)
                       export-dir))
         (org-export-show-temporary-export-buffer nil)
         (org-confirm-babel-evaluate nil))
    (make-directory export-dir t)
    (my/org-render-mermaid-blocks)
    (my/org-copy-export-assets export-dir)
    (org-export-to-file 'html output-file)
    (browse-url-of-file output-file)
    (message <span class="org-string">"Exported HTML to %s"</span> output-file)))

(<span class="org-keyword">with-eval-after-load</span> 'org
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-mermaid</span>)
  (<span class="org-keyword">setq</span> org-babel-python-command <span class="org-string">"python3"</span>)
  (<span class="org-keyword">setq</span> org-babel-js-cmd <span class="org-string">"node"</span>)
  (add-hook 'org-insert-heading-hook #'my/org-add-id-to-new-heading)
  (advice-add 'org-return <span class="org-builtin">:before</span> #'my/org-return-stamp-id-before)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (python . t)
     (nix . t)
     (js . t)
     (coffee . t)
     (mermaid . t))))

(add-hook 'org-mode-hook 'my-org-mode-banner)
</pre>
</div>
</div>
</div>
<div id="outline-container-org542264c" class="outline-2">
<h2 id="org542264c"><span class="section-number-2">8.</span> AI helpers</h2>
<div class="outline-text-2" id="text-8">
<p>
This section pulls in a small collection of AI-adjacent packages.
</p>

<p>
The shape of the config suggests a few things:
</p>

<ul class="org-ul">
<li><code>gptel</code> is the lightest-weight chat integration.</li>
<li><code>aidermacs</code> is for repo-aware editing assistance.</li>
<li><code>pi-coding-agent</code> is installed via Nix and treated as a first-class tool.</li>
<li>model names and API keys are driven by environment variables where needed.</li>
</ul>

<p>
I am preserving the exact behavior here rather than trying to rationalize it.
In particular, several of these packages overlap conceptually, but that may be
intentional experimentation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> gptel
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> gptel-api-key (getenv <span class="org-string">"OPENAI_API_KEY"</span>))
  (<span class="org-keyword">setq</span> gptel-default-model <span class="org-string">"gpt-4o"</span>))

(<span class="org-keyword">use-package</span> elysium)

(<span class="org-keyword">with-eval-after-load</span> 'evil
  (define-key evil-normal-state-map (kbd <span class="org-string">"C-c g"</span>) 'gptel))

(<span class="org-keyword">use-package</span> aidermacs
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> aidermacs-api-key (getenv <span class="org-string">"OPENAI_API_KEY"</span>))
  (<span class="org-keyword">setq</span> aidermacs-default-model <span class="org-string">"gpt-4o"</span>)
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c a"</span> . aidermacs-transient-menu)))

(global-set-key (kbd <span class="org-string">"C-c g c"</span>) 'gptel-start-chat)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c51a81" class="outline-2">
<h2 id="org4c51a81"><span class="section-number-2">9.</span> Window movement and in-buffer discoverability</h2>
<div class="outline-text-2" id="text-9">
<p>
These bindings repurpose <code>C-h/j/k/l</code> for pane movement.
</p>

<p>
That is a very Vim/Evil-shaped choice, and it explains why default Emacs help
commands feel displaced elsewhere. Because <code>C-h</code> normally starts Help, the
config also puts Help on <code>C-c h</code>.
</p>

<p>
This is likely the source of some of the earlier confusion around <code>describe-key</code>
not being reachable via the stock Emacs help prefix.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(windmove-default-keybindings)

(global-set-key (kbd <span class="org-string">"C-h"</span>) 'windmove-left)
(global-set-key (kbd <span class="org-string">"C-j"</span>) 'windmove-down)
(global-set-key (kbd <span class="org-string">"C-k"</span>) 'windmove-up)
(global-set-key (kbd <span class="org-string">"C-l"</span>) 'windmove-right)
(global-set-key (kbd <span class="org-string">"C-c h"</span>) 'help-command)
</pre>
</div>
</div>
</div>
