modules/home/emacs/init.org
* General packages

This is the miscellaneous toolbox section.

- =org-bullets= prettifies Org headings.
- =neotree= provides a file sidebar that feels familiar to users coming from
  tools like NERDTree.
- =which-key= improves discoverability by showing possible key continuations.
- =magit= is the Git workhorse.
- =nix-mode= is essential in this repository.
- =eat= is a terminal emulator installed through Nix rather than MELPA.
- =pi-coding-agent= is also installed declaratively and merely configured here.

#+begin_src emacs-lisp
(use-package org-bullets
  :hook (org-mode . org-bullets-mode))

(use-package neotree
  :ensure t
  :config
  (setq neo-smart-open t)
  (setq neo-show-hidden-files t)
  (global-set-key (kbd "<f8>") #'neotree-toggle))

(use-package which-key
  :config
  (which-key-mode))

(use-package magit
  :commands magit-status)

(use-package nix-mode
  :mode "\\.nix\\'")

(use-package eat
  :ensure nil
  :commands (eat)
  :config
  (setq eat-kill-buffer-on-exit t))

(use-package pi-coding-agent
  :ensure nil
  :commands (pi-coding-agent pi-coding-agent-toggle pi-coding-agent-install-grammars)
  :init
  (defalias 'pi 'pi-coding-agent))
#+end_src

* Local terminal helper

This helper opens Eat in the current project root when possible.

That means terminal sessions start in the place where work is actually being
performed instead of some unrelated default directory. In a project-oriented
workflow, that is almost always the desired behavior.

#+begin_src emacs-lisp
(defun my/eat-here ()
  "Open Eat in the current project root, or `default-directory'."
  (interactive)
  (require 'project)
  (let ((default-directory
          (or (when-let ((proj (project-current nil)))
                (project-root proj))
              default-directory)))
    (eat)))
#+end_src

* Journal and note capture
This repository strongly suggests that =~/chronofile= is the main note store, so the journal is rooted there as well.
:PROPERTIES:
:ID:       01KT47B1EER41R967Q1JPZMFX1
:END:

The journal configuration is intentionally minimal:

- daily files under =~/chronofile/journal/=
- ISO-like file names
- human-readable date headings
- a global key to create a new entry quickly

#+begin_src emacs-lisp
(use-package org-journal
  :ensure t
  :config
  (setq org-journal-dir "~/chronofile/journal/")
  (setq org-journal-file-format "%Y-%m-%d.org")
  (setq org-journal-date-format "%A, %d %B %Y"))

(global-set-key (kbd "C-c j") 'org-journal-new-entry)
#+end_src

* Basic UI defaults

These are the expected quality-of-life defaults for a keyboard-first setup:

- disable menu/tool/scroll bars,
- skip the startup screen,
- show line numbers,
- use a slightly larger default font,
- auto-revert buffers when files change on disk,
- wrap long visual lines.

#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-startup-screen t)

(global-display-line-numbers-mode t)

(set-face-attribute 'default nil :height 110)

(global-auto-revert-mode t)

(global-visual-line-mode t)
#+end_src

* Undo / redo sanity

Emacs absolutely does ship with undo, but the default ergonomics are eccentric
enough that it can feel like it does not. Since this setup is already heavily
Evil-flavored, it makes sense to be explicit here.

This keeps two worlds reasonably sane:
- in Evil buffers, use Emacs' built-in modern undo/redo backend so =u= and
  =C-r= behave more like a Vim refugee would hope,
- in non-Evil / Emacs-style contexts, make =C-/= undo and =C-?= redo.

#+begin_src emacs-lisp
(global-set-key (kbd "C-/") #'undo-only)
(global-set-key (kbd "C-?") #'undo-redo)
#+end_src

