modules/home/emacs/exports/init.html
<div id="outline-container-orgbd97ef1" class="outline-2">
<h2 id="orgbd97ef1"><span class="section-number-2">10.</span> General packages</h2>
<div class="outline-text-2" id="text-10">
<p>
This is the miscellaneous toolbox section.
</p>

<ul class="org-ul">
<li><code>org-bullets</code> prettifies Org headings.</li>
<li><code>neotree</code> provides a file sidebar that feels familiar to users coming from
tools like NERDTree.</li>
<li><code>which-key</code> improves discoverability by showing possible key continuations.</li>
<li><code>magit</code> is the Git workhorse.</li>
<li><code>nix-mode</code> is essential in this repository.</li>
<li><code>eat</code> is a terminal emulator installed through Nix rather than MELPA.</li>
<li><code>pi-coding-agent</code> is also installed declaratively and merely configured here.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-bullets
  <span class="org-builtin">:hook</span> (org-mode . org-bullets-mode))

(<span class="org-keyword">use-package</span> neotree
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> neo-smart-open t)
  (<span class="org-keyword">setq</span> neo-show-hidden-files t)
  (global-set-key (kbd <span class="org-string">"&lt;f8&gt;"</span>) #'neotree-toggle))

(<span class="org-keyword">use-package</span> which-key
  <span class="org-builtin">:config</span>
  (which-key-mode))

(<span class="org-keyword">use-package</span> magit
  <span class="org-builtin">:commands</span> magit-status)

(<span class="org-keyword">use-package</span> nix-mode
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.nix\\'"</span>)

(<span class="org-keyword">use-package</span> eat
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:commands</span> (eat)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> eat-kill-buffer-on-exit t))

(<span class="org-keyword">use-package</span> pi-coding-agent
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:commands</span> (pi-coding-agent pi-coding-agent-toggle pi-coding-agent-install-grammars)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">defalias</span> '<span class="org-function-name">pi</span> 'pi-coding-agent))
</pre>
</div>
</div>
</div>
<div id="outline-container-org42c9905" class="outline-2">
<h2 id="org42c9905"><span class="section-number-2">11.</span> Local terminal helper</h2>
<div class="outline-text-2" id="text-11">
<p>
This helper opens Eat in the current project root when possible.
</p>

<p>
That means terminal sessions start in the place where work is actually being
performed instead of some unrelated default directory. In a project-oriented
workflow, that is almost always the desired behavior.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/eat-here</span> ()
  <span class="org-doc">"Open Eat in the current project root, or `</span><span class="org-doc"><span class="org-constant">default-directory</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">project</span>)
  (<span class="org-keyword">let</span> ((default-directory
          (<span class="org-keyword">or</span> (<span class="org-keyword">when-let</span> ((proj (project-current nil)))
                (project-root proj))
              default-directory)))
    (eat)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c63dc7" class="outline-2">
<h2 id="org4c63dc7"><span class="section-number-2">12.</span> Journal and note capture</h2>
<div class="outline-text-2" id="text-12">
<p>
This repository strongly suggests that <code>~/chronofile</code> is the main note store, so the journal is rooted there as well.
</p>
<p>
:ID:       01KT47B1EER41R967Q1JPZMFX1
</p>

<p>
The journal configuration is intentionally minimal:
</p>

<ul class="org-ul">
<li>daily files under <code>~/chronofile/journal/</code></li>
<li>ISO-like file names</li>
<li>human-readable date headings</li>
<li>a global key to create a new entry quickly</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-journal
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> org-journal-dir <span class="org-string">"~/chronofile/journal/"</span>)
  (<span class="org-keyword">setq</span> org-journal-file-format <span class="org-string">"%Y-%m-%d.org"</span>)
  (<span class="org-keyword">setq</span> org-journal-date-format <span class="org-string">"%A, %d %B %Y"</span>))

(global-set-key (kbd <span class="org-string">"C-c j"</span>) 'org-journal-new-entry)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5587451" class="outline-2">
<h2 id="org5587451"><span class="section-number-2">13.</span> Basic UI defaults</h2>
<div class="outline-text-2" id="text-13">
<p>
These are the expected quality-of-life defaults for a keyboard-first setup:
</p>

<ul class="org-ul">
<li>disable menu/tool/scroll bars,</li>
<li>skip the startup screen,</li>
<li>show line numbers,</li>
<li>use a slightly larger default font,</li>
<li>auto-revert buffers when files change on disk,</li>
<li>wrap long visual lines.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(<span class="org-keyword">setq</span> inhibit-startup-screen t)

(global-display-line-numbers-mode t)

(set-face-attribute 'default nil <span class="org-builtin">:height</span> 110)

(global-auto-revert-mode t)

(global-visual-line-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org16aee04" class="outline-2">
<h2 id="org16aee04"><span class="section-number-2">14.</span> Undo / redo sanity</h2>
<div class="outline-text-2" id="text-14">
<p>
Emacs absolutely does ship with undo, but the default ergonomics are eccentric
enough that it can feel like it does not. Since this setup is already heavily
Evil-flavored, it makes sense to be explicit here.
</p>

<p>
This keeps two worlds reasonably sane:
</p>
<ul class="org-ul">
<li>in Evil buffers, use Emacs' built-in modern undo/redo backend so <code>u</code> and
<code>C-r</code> behave more like a Vim refugee would hope,</li>
<li>in non-Evil / Emacs-style contexts, make <code>C-/</code> undo and <code>C-?</code> redo.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-/"</span>) #'undo-only)
(global-set-key (kbd <span class="org-string">"C-?"</span>) #'undo-redo)
</pre>
</div>
</div>
</div>
