modules/home/emacs/init.org
* Chronofile-centric Org workflow

This section is where the Emacs configuration and the repository's larger
personal knowledge management story really meet.

The intention is clear and good:

- treat =~/chronofile= as the canonical Org directory,
- discover agenda files recursively,
- exclude obvious transient junk,
- provide convenience commands for agenda and todo views,
- capture new tasks into =~/chronofile/inbox.org=.

This is a nice match for an Org-first workflow without requiring a large extra
framework such as Org-roam.

#+begin_src emacs-lisp
(global-set-key (kbd "C-x g") 'magit-status)
(global-set-key (kbd "C-c a") #'my/org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c e t") #'my/eat-here)
(global-set-key (kbd "C-c e h") #'my/org-export-to-html)
(global-set-key (kbd "C-c p i") #'pi-coding-agent)

(setq org-directory "~/chronofile")
(setq org-default-notes-file (concat org-directory "/notes.org"))

(defun my/org-chronofile-files ()
  "Return usable Org files under `org-directory'."
  (seq-filter
   (lambda (path)
     (let ((base (file-name-nondirectory path)))
       (and (file-regular-p path)
            (not (string-prefix-p ".#" base))
            (not (and (string-prefix-p "#" base)
                      (string-suffix-p "#" base)))
            (not (string-match-p "/node_modules/" path)))))
   (directory-files-recursively (expand-file-name org-directory) "\\.org\\'")))

(defun my/org-refresh-agenda-files ()
  "Refresh `org-agenda-files' from `org-directory'."
  (setq org-agenda-files (my/org-chronofile-files)))

(defun my/org-agenda ()
  "Open `org-agenda' using all Org files in `~/chronofile'."
  (interactive)
  (my/org-refresh-agenda-files)
  (call-interactively #'org-agenda))

(defun my/org-chronofile-todos ()
  "Show all TODO items from Org files under `~/chronofile'."
  (interactive)
  (my/org-refresh-agenda-files)
  (org-todo-list))

(my/org-refresh-agenda-files)

(setq org-capture-templates
      '(("t" "Todo" entry (file+headline "~/chronofile/inbox.org" "Tasks")
         "* TODO %?\n  %i\n  %a")))
#+end_src

* Evil mode

This is the modal editing section.

The configuration does a few careful things here:

- ensures Evil is installed even in a package.el world,
- tells Evil to use Emacs' built-in undo/redo backend,
- enables Evil globally,
- reinforces =C-h/j/k/l= window movement inside Evil states,
- gives Org buffers sane normal-state bindings for folding and link opening,
- makes special-purpose buffers start in the most natural state.

That last part matters. Chat views, agenda screens, transient popups, and
terminal-like prompts all want different default modes if Evil is enabled.
The hooks below encode those preferences.

#+begin_src emacs-lisp
(unless (package-installed-p 'evil)
  (package-install 'evil))

(require 'evil)
(setq evil-undo-system 'undo-redo)
(evil-mode 1)

(dolist (state '(normal motion visual))
  (evil-global-set-key state (kbd "C-h") #'windmove-left)
  (evil-global-set-key state (kbd "C-j") #'windmove-down)
  (evil-global-set-key state (kbd "C-k") #'windmove-up)
  (evil-global-set-key state (kbd "C-l") #'windmove-right))

(with-eval-after-load 'org
  (dolist (state '(normal motion))
    (evil-define-key state org-mode-map (kbd "TAB") #'org-cycle)
    (evil-define-key state org-mode-map (kbd "<tab>") #'org-cycle)
    (evil-define-key state org-mode-map (kbd "S-TAB") #'org-shifttab)
    (evil-define-key state org-mode-map (kbd "<backtab>") #'org-shifttab)
    (evil-define-key state org-mode-map (kbd "RET") #'org-open-at-point)))

(with-eval-after-load 'evil
  (evil-ex-define-cmd "org-agenda" #'my/org-agenda)
  (evil-ex-define-cmd "todos" #'my/org-chronofile-todos)
  (evil-ex-define-cmd "org-todos" #'my/org-chronofile-todos))

(with-eval-after-load 'pi-coding-agent
  (evil-set-initial-state 'pi-coding-agent-chat-mode 'normal)
  (evil-set-initial-state 'pi-coding-agent-input-mode 'insert)
  (add-hook 'pi-coding-agent-chat-mode-hook #'evil-normal-state)
  (add-hook 'pi-coding-agent-input-mode-hook #'evil-insert-state))

(with-eval-after-load 'transient
  (evil-set-initial-state 'transient-mode 'normal))

(with-eval-after-load 'aidermacs-backend-comint
  (evil-set-initial-state 'aidermacs-comint-mode 'insert)
  (add-hook 'aidermacs-comint-mode-hook #'evil-insert-state))

(with-eval-after-load 'aidermacs-backend-vterm
  (add-hook 'aidermacs-vterm-mode-hook #'evil-insert-state))

(with-eval-after-load 'aidermacs-output
  (evil-set-initial-state 'aidermacs-file-diff-selection-mode 'normal)
  (add-hook 'aidermacs-file-diff-selection-mode-hook #'evil-normal-state))

(with-eval-after-load 'org-agenda
  (evil-set-initial-state 'org-agenda-mode 'normal)
  (add-hook 'org-agenda-mode-hook #'evil-normal-state)
  (evil-define-key 'normal org-agenda-mode-map
    (kbd "j") #'org-agenda-next-line
    (kbd "k") #'org-agenda-previous-line
    (kbd "gr") #'org-agenda-redo
    (kbd "RET") #'org-agenda-switch-to
    (kbd "TAB") #'org-agenda-goto
    (kbd "t") #'org-agenda-todo
    (kbd "q") #'org-agenda-quit))
#+end_src

* Final global bindings

This last bit is tiny, but it is worth leaving separate because it reads like
"top-level finish work": a dedicated key for sending the current gptel prompt.

#+begin_src emacs-lisp
(global-set-key (kbd "<f9>") 'gptel-send)
#+end_src

