modules/home/emacs/exports/init.html
<div id="outline-container-org8ce93b4" class="outline-2">
<h2 id="org8ce93b4"><span class="section-number-2">15.</span> Chronofile-centric Org workflow</h2>
<div class="outline-text-2" id="text-15">
<p>
This section is where the Emacs configuration and the repository's larger
personal knowledge management story really meet.
</p>

<p>
The intention is clear and good:
</p>

<ul class="org-ul">
<li>treat <code>~/chronofile</code> as the canonical Org directory,</li>
<li>discover agenda files recursively,</li>
<li>exclude obvious transient junk,</li>
<li>provide convenience commands for agenda and todo views,</li>
<li>capture new tasks into <code>~/chronofile/inbox.org</code>.</li>
</ul>

<p>
This is a nice match for an Org-first workflow without requiring a large extra
framework such as Org-roam.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-x g"</span>) 'magit-status)
(global-set-key (kbd <span class="org-string">"C-c a"</span>) #'my/org-agenda)
(global-set-key (kbd <span class="org-string">"C-c c"</span>) 'org-capture)
(global-set-key (kbd <span class="org-string">"C-c e t"</span>) #'my/eat-here)
(global-set-key (kbd <span class="org-string">"C-c e h"</span>) #'my/org-export-to-html)
(global-set-key (kbd <span class="org-string">"C-c p i"</span>) #'pi-coding-agent)

(<span class="org-keyword">setq</span> org-directory <span class="org-string">"~/chronofile"</span>)
(<span class="org-keyword">setq</span> org-default-notes-file (concat org-directory <span class="org-string">"/notes.org"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-chronofile-files</span> ()
  <span class="org-doc">"Return usable Org files under `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">'."</span>
  (seq-filter
   (<span class="org-keyword">lambda</span> (path)
     (<span class="org-keyword">let</span> ((base (file-name-nondirectory path)))
       (<span class="org-keyword">and</span> (file-regular-p path)
            (not (string-prefix-p <span class="org-string">".#"</span> base))
            (not (<span class="org-keyword">and</span> (string-prefix-p <span class="org-string">"#"</span> base)
                      (string-suffix-p <span class="org-string">"#"</span> base)))
            (not (string-match-p <span class="org-string">"/node_modules/"</span> path)))))
   (directory-files-recursively (expand-file-name org-directory) <span class="org-string">"\\.org\\'"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-refresh-agenda-files</span> ()
  <span class="org-doc">"Refresh `</span><span class="org-doc"><span class="org-constant">org-agenda-files</span></span><span class="org-doc">' from `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">setq</span> org-agenda-files (my/org-chronofile-files)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-agenda</span> ()
  <span class="org-doc">"Open `</span><span class="org-doc"><span class="org-constant">org-agenda</span></span><span class="org-doc">' using all Org files in `</span><span class="org-doc"><span class="org-constant">~/chronofile</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (my/org-refresh-agenda-files)
  (call-interactively #'org-agenda))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-chronofile-todos</span> ()
  <span class="org-doc">"Show all TODO items from Org files under `</span><span class="org-doc"><span class="org-constant">~/chronofile</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (my/org-refresh-agenda-files)
  (org-todo-list))

(my/org-refresh-agenda-files)

(<span class="org-keyword">setq</span> org-capture-templates
      '((<span class="org-string">"t"</span> <span class="org-string">"Todo"</span> entry (file+headline <span class="org-string">"~/chronofile/inbox.org"</span> <span class="org-string">"Tasks"</span>)
         <span class="org-string">"* TODO %?\n  %i\n  %a"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org9ef1382" class="outline-2">
<h2 id="org9ef1382"><span class="section-number-2">16.</span> Evil mode</h2>
<div class="outline-text-2" id="text-16">
<p>
This is the modal editing section.
</p>

<p>
The configuration does a few careful things here:
</p>

<ul class="org-ul">
<li>ensures Evil is installed even in a package.el world,</li>
<li>tells Evil to use Emacs' built-in undo/redo backend,</li>
<li>enables Evil globally,</li>
<li>reinforces <code>C-h/j/k/l</code> window movement inside Evil states,</li>
<li>gives Org buffers sane normal-state bindings for folding and link opening,</li>
<li>makes special-purpose buffers start in the most natural state.</li>
</ul>

<p>
That last part matters. Chat views, agenda screens, transient popups, and
terminal-like prompts all want different default modes if Evil is enabled.
The hooks below encode those preferences.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> (package-installed-p 'evil)
  (package-install 'evil))

(<span class="org-keyword">require</span> '<span class="org-constant">evil</span>)
(<span class="org-keyword">setq</span> evil-undo-system 'undo-redo)
(evil-mode 1)

(<span class="org-keyword">dolist</span> (state '(normal motion visual))
  (evil-global-set-key state (kbd <span class="org-string">"C-h"</span>) #'windmove-left)
  (evil-global-set-key state (kbd <span class="org-string">"C-j"</span>) #'windmove-down)
  (evil-global-set-key state (kbd <span class="org-string">"C-k"</span>) #'windmove-up)
  (evil-global-set-key state (kbd <span class="org-string">"C-l"</span>) #'windmove-right))

(<span class="org-keyword">with-eval-after-load</span> 'org
  (<span class="org-keyword">dolist</span> (state '(normal motion))
    (<span class="org-keyword">evil-define-key</span> state org-mode-map (kbd <span class="org-string">"TAB"</span>) #'org-cycle)
    (<span class="org-keyword">evil-define-key</span> state org-mode-map (kbd <span class="org-string">"&lt;tab&gt;"</span>) #'org-cycle)
    (<span class="org-keyword">evil-define-key</span> state org-mode-map (kbd <span class="org-string">"S-TAB"</span>) #'org-shifttab)
    (<span class="org-keyword">evil-define-key</span> state org-mode-map (kbd <span class="org-string">"&lt;backtab&gt;"</span>) #'org-shifttab)
    (<span class="org-keyword">evil-define-key</span> state org-mode-map (kbd <span class="org-string">"RET"</span>) #'org-open-at-point)))

(<span class="org-keyword">with-eval-after-load</span> 'evil
  (<span class="org-keyword">evil-ex-define-cmd</span> <span class="org-string">"org-agenda"</span> #'my/org-agenda)
  (<span class="org-keyword">evil-ex-define-cmd</span> <span class="org-string">"todos"</span> #'my/org-chronofile-todos)
  (<span class="org-keyword">evil-ex-define-cmd</span> <span class="org-string">"org-todos"</span> #'my/org-chronofile-todos))

(<span class="org-keyword">with-eval-after-load</span> 'pi-coding-agent
  (evil-set-initial-state 'pi-coding-agent-chat-mode 'normal)
  (evil-set-initial-state 'pi-coding-agent-input-mode 'insert)
  (add-hook 'pi-coding-agent-chat-mode-hook #'evil-normal-state)
  (add-hook 'pi-coding-agent-input-mode-hook #'evil-insert-state))

(<span class="org-keyword">with-eval-after-load</span> 'transient
  (evil-set-initial-state 'transient-mode 'normal))

(<span class="org-keyword">with-eval-after-load</span> 'aidermacs-backend-comint
  (evil-set-initial-state 'aidermacs-comint-mode 'insert)
  (add-hook 'aidermacs-comint-mode-hook #'evil-insert-state))

(<span class="org-keyword">with-eval-after-load</span> 'aidermacs-backend-vterm
  (add-hook 'aidermacs-vterm-mode-hook #'evil-insert-state))

(<span class="org-keyword">with-eval-after-load</span> 'aidermacs-output
  (evil-set-initial-state 'aidermacs-file-diff-selection-mode 'normal)
  (add-hook 'aidermacs-file-diff-selection-mode-hook #'evil-normal-state))

(<span class="org-keyword">with-eval-after-load</span> 'org-agenda
  (evil-set-initial-state 'org-agenda-mode 'normal)
  (add-hook 'org-agenda-mode-hook #'evil-normal-state)
  (<span class="org-keyword">evil-define-key</span> 'normal org-agenda-mode-map
    (kbd <span class="org-string">"j"</span>) #'org-agenda-next-line
    (kbd <span class="org-string">"k"</span>) #'org-agenda-previous-line
    (kbd <span class="org-string">"gr"</span>) #'org-agenda-redo
    (kbd <span class="org-string">"RET"</span>) #'org-agenda-switch-to
    (kbd <span class="org-string">"TAB"</span>) #'org-agenda-goto
    (kbd <span class="org-string">"t"</span>) #'org-agenda-todo
    (kbd <span class="org-string">"q"</span>) #'org-agenda-quit))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge9e8084" class="outline-2">
<h2 id="orge9e8084"><span class="section-number-2">17.</span> Final global bindings</h2>
<div class="outline-text-2" id="text-17">
<p>
This last bit is tiny, but it is worth leaving separate because it reads like
"top-level finish work": a dedicated key for sending the current gptel prompt.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"&lt;f9&gt;"</span>) 'gptel-send)
</pre>
</div>
</div>
</div>
