modules/home/emacs/exports/init.html
<div id="outline-container-org86a7ce1" class="outline-2">
<h2 id="org86a7ce1"><span class="section-number-2">18.</span> Notes for future cleanup</h2>
<div class="outline-text-2" id="text-18">
<p>
A few things could be rationalized later if desired:
</p>

<ul class="org-ul">
<li>more of the Emacs package set could be moved fully into Nix,</li>
<li>package.el bootstrapping could shrink once enough packages are declarative,</li>
<li>the write-protected init warning is usually a sign that Customize wants its
own writable <code>custom-file</code>,</li>
<li>some overlapping AI packages may eventually consolidate.</li>
</ul>

<p>
But for now the point of this file is not ideological purity. The point is to
make the current setup readable, explainable, and tanglable.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Lambert</p>
<p class="date">Created: 2026-06-05 Fri 16:13</p>
</div>
</body>
</html>
